Revit 2024 API
ValueAtPoint.SetFlags Method
Overload List
Name | Description
SetFlags(IList<Int32>)
 Independently sets the flags associated to all measurements.
 (Inherited from ValueAtPointBase.)
SetFlags(Int32)
 Sets the flags associated to all measurements to the same value.
 (Inherited from ValueAtPointBase.)
SetFlags(Int32, Int32)
 Sets the flags associated to a given measurement.
 (Inherited from ValueAtPointBase.)
See Also
ValueAtPoint Class
ValueAtPoint Members
Autodesk.Revit.DB.Analysis Namespace